[
  "Varadaraj Gholap\nWeb Developer\nGitHub\nvaradgholap163@gmail.com  • 8421882858  • Pune, Maharashtra\nSUMMARY\nAs a passionate Full-Stack Web Developer , I specialize in building fast, modern, and interactive applications using React and \nNext.js . I focus on delivering polished user experiences, clean architecture, and scalable features. With hands-on experience \nacross both frontend and backend development, I’m excited to contribute to impactful projects, solve real-world problems, and \ngrow as a strong engineering professional.\nSKILLS\nProgramming Languages Python, JavaScript, C++, TypeScript\nWeb Development HTML, CSS, Next.js, Node.js, Bootstrap, Sanity, Clerk, Socket.io\nDatabases MongoDB, Neon, Prisma\nSoft Skills Communication, Teamwork, Problem Solving\nVersion Control Git, GitHub",
  "Soft Skills Communication, Teamwork, Problem Solving\nVersion Control Git, GitHub\nContent Management Systems Redux Toolkit, Sanity\nEDUCATION\nBachelor of Engineering (B.E.)\nP .E.S Modern College of Engineering, Shivajinagar, Pune , Pune, Maharashtra 2023 -  2027\n• Currently pursuing a Bachelor of Engineering (B.E.)  with a specialization in Artificial Intelligence and Machine Learning \n(AIML) , laying a strong foundation in AI, machine learning , and data structures .\nPROJECTS\nGeoAlert\nNextjs ,Prisma, Leaflet-map,Typescript,Socket.io GitHub\n• Built a real-time disaster alert platform using Next.js, Leaflet.js, Prisma, and PostgreSQL  with live hazard mapping and \nsafe-zone visualization. Implemented Socket.io -based instant alerts , geolocation tracking, and optimal map rendering using",
  "SSR-safe dynamic imports. Designed a role-based Admin Dashboard  for managing alerts, zones, and user safety statuses. \nDeveloped reliable REST APIs and WebSocket channels ensuring fast, scalable communication during emergencies\nAttendX\nNextjs, MongoDB, PrismaORM, HTML5-QRcode Scanner,NextAuth GitHub\n• Developed a secure, QR-based attendance system where teachers generate time-limited, tamper-proof QR codes  and students \nscan them for instant, proxy-free attendance marking. Ensured fast validation with real-time processing, secure token verifi-\ncation, and backend safeguards against manipulation. Built a clean, intuitive dashboard supporting live attendance tracking, \nsession management, and role-based access for teachers and students.\n Ai-PromptFusion",
  "session management, and role-based access for teachers and students.\n Ai-PromptFusion\nNextJs,FireBase,Clerk,ShadCn,KravixStudio GitHub\n• Built an intelligent AI comparison platform using Next.js  that sends a single prompt to multiple AI models, aggregates their \nresponses, and displays them in a clean, organized interface. Designed to help users analyze model strengths, compare \nreasoning patterns, and generate combined insights. Enables faster decision-making by presenting diverse AI perspectives \nside-by-side with smooth UI interactions and optimized backend request handling.\nMockMate\nNextJs , Neondb, Clerk , GeminiAPI , WebRTC GitHub\n• Developed an intelligent interview simulation platform powered by Gemini AI  that replicates real hiring conversations. Users",
  "receive dynamically generated questions, adaptive follow-up prompts, and instant feedback on their responses. Includes cus-\ntomizable difficulty levels, role-based scenarios, and real-time guidance to help learners improve confidence, communication, \nand overall interview performance."
]